{
  "basics": {
    "name": "Jason Swindle",
    "label": "DevOps Professional",
    "picture": "",
    "email": "jason.swindle@gmail.com",
    "phone": "+1 (256) 275 - 4228",
    "website": "http://resume.swindle.me",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Seattle",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "jasonswindle",
        "url": "https://www.linkedin.com/in/jasonswindle"
      },
      {
        "network": "Github",
        "username": "jasonswindle",
        "url": "https://github.com/JasonSwindle"
      },
      {
        "network": "Keybase",
        "username": "jasonswindle",
        "url": "https://keybase.io/jasonswindle"
      }
    ]
  },
  "work": [
    {
      "company": "Amazon Web Services",
      "position": "Cloud Support Engineer I (Level 4)",
      "website": "https://aws.amazon.com/",
      "startDate": "2015-04-13",
      "summary": "...",
      "highlights": [
        "..."
      ]
    },
    {
      "company": "Rackspace US, Inc.",
      "position": "Linux Operations Administrator I",
      "website": "https://www.rackspace.com/",
      "startDate": "2014-04-29",
      "endDate": "2015-03-19",
      "summary": "...",
      "highlights": [
        "Helped removed 50 terabyte of backups, saving Rackspace money on a 3rd party backup service.",
        "Linux operations administrator for Rackspace Cloud Databases (OpenStack Trove).",
        "Successfully deployed SaltStack to two Data Centers with no customer impact or downtime.",
        "Implemented a SaltStack Master of Masters, via Docker, to manage 6+ SaltStack Masters.",
        "First contact on all tickets and phone calls during first shift.",
        "Helped create classes for Rackspace’s training program to create a culture of improvement and education."
      ]
    },
    {
      "company": "Rackspace US, Inc.",
      "position": "Cloud Launch Manager I",
      "website": "https://www.rackspace.com/",
      "startDate": "2013-02-12",
      "endDate": "2014-04-29",
      "summary": "...",
      "highlights": [
        "Maintained an account base of 60 customers for the duration of their first 60 days as a Rackspace Customer.",
        "Built strong relationships with 3rd party vendors like New Relic, SaltStack, and CloudFlare.",
        "Architected scalable Cloud deployments to allow a customer to grow with their needs.",
        "Designed, deployed, and managed the infrastructure for several internal tools.",
        "Became a SaltStack Certified Engineer and gave a talk at SaltConf 2014.",
        "Gave a talk at Cloud Mafia about Rackspace, DevOps, and SaltStack."
      ]
    },
    {
      "company": "Rackspace US, Inc.",
      "position": "Cloud Sites Linux Administrator I",
      "website": "https://www.rackspace.com/",
      "startDate": "2010-08-16",
      "endDate": "2013-02-12",
      "summary": "...",
      "highlights": [
        "Provided Fanatical Support to customers and Rackers via phone, chat, and tickets.",
        "A strong understanding of the Cloud Sites infrastructure and how to support it.",
        "Escalation paths for customers needing complex technical help or needing to air grievances.",
        "A great knowledge of our customers and how issues/outages impact the front-line support.",
        "Close partnership with System Operations to resolve customer or system issues.",
        "Self-driven without direct supervision and managed the customer load on the support floor."
      ]
    },
    {
      "company": "Computer Sales and Services, Inc.",
      "position": "Support Specialist",
      "website": "http://www.cssla.com/",
      "startDate": "2009-05-19",
      "endDate": "2010-08-16",
      "summary": "...",
      "highlights": [
        "Monitored 300+ network items via SNMP in Cacti and The Dude.",
        "The main support agent for the critical Point-to-Point wireless network for Iberville Bank and all its branches. This support was provided to the Information System Officer via e-mail, phone, and SMS.",
        "Implemented an inventory system via Excel to track asset deployed and asset on-hand.",
        "Provide phone-based support for website hosting, FTP, and Internet service.",
        "Installed point-to-multipoint wireless equipment at the customers premise.",
        "Supported our in-house e-mail via POP3, IMAP, SMTP, and web interface."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "ATX Hack for Change",
      "position": "Advisor",
      "website": "http://atxhackforchange.org/",
      "startDate": "2013-04-31",
      "endDate": "2013-05-02",
      "summary": "...",
      "highlights": [
        "..."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of North Alabama",
      "area": "Computer Information Systems",
      "studyType": "Bachelor of Business Administration",
      "startDate": "2004-06-01",
      "endDate": "2008-12-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "SaltStack Certified Engineer (SSCE)",
      "date": "2014-01-29",
      "awarder": "SaltStack, Inc.",
      "summary": "13th SaltStack Certified Engineer Globally (0x2E6A0C88)"
    }
  ],
  "publications": [],
  "skills": [
    {
      "name": "DevOps",
      "level": "",
      "keywords": [
        "Docker / Dockerfile",
        "CI / CD",
        "SaltStack / Salt",
        "Git / Github"
      ]
    },
    {
      "name": "Markup Languages",
      "level": "",
      "keywords": [
        "YAML",
        "JSON",
        "Markdown"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": [
    {
      "name": "Joseph Palumbo",
      "reference": "Jason Swindle is one of the original and founding members of the Cloud Launch Team. He and his teammate are responsible for building a one of the most successful additions to the modern Fanatical Support experience by providing a strategic bridge between sales and support.  This team is credited with increased activations, increased revenue and decreased churn among new customers.  It’s important to note that this team spent the first year onboarding all cloud customers without dedicated systems, broad autonomy and a job description that could change from one day to the next. Despite those challenges, Jason Swindle was able to provide his customers with a Fanatical onboarding experience while providing key insights and operational observations to help guide the team’s maturation.  Jason has a real passion for technology that addressed an important gap in the team’s collective skill set. Jason took it upon himself to become an expert on cloud automation. He would later use this skill by designing the infrastructure for the Graffiti project, which earned him the opportunity to speak at last year’s SaltStack Conference. During that time Jason became one of the first people within the industry to become a certified SaltStack Engineer.  In addition to Jason’s professional skills, he should be recognized for his earnest approach to connecting with those around him. This has translated into Jason building many genuine and lasting professional relationships among his peers and leadership.  As is his way, I know Jason will continue to keep his eye on the horizon of technology and be quick to share with those around him. While Jason’s contributions to the Cloud Launch Team have already had a profound positive influence on Rackspace, I’m eager to see the results of his future endeavors."
    },
    {
      "name": "Alan Bush",
      "reference": "I've had the opportunity to work with Jason Swindle since early 2013. In this time I have seen Jason learn many new skills. Our team needed to learn more about configuration management tools, and Jason went out and learned SaltStack. He didn't stop there, though - he went on to use Salt to build and maintain the infrastructure for several internal tools. Then he went on to speak about Salt at conferences, including the first ever Salt Conf. Then he became the 13th person in the world to earn the 'SaltStack Certified Engineer' certification. Recently, his project has necessitated using Docker. I have no doubt that he will become a master of Docker, the same way he has become a master of Salt. Jason is an extremely technical, fast learning, intelligent asset to any team in any organization. Hire this guy."
    }
  ]
}
